In [1]:
import numpy as np
import pandas as pd

In [2]:
arr1 = np.random.randint(0,100,(3,4))
df1 = pd.DataFrame(arr1, columns=["a","b","c","d"])
arr2 = np.random.randint(0,100,(3,4))
df2 = pd.DataFrame(arr2, columns=["e","f","g","h"])

In [3]:
df1

    a   b   c   d
0   4  19  14  65
1  70  89  56  49
2  31  30  18   7

In [4]:
df2

    e   f   g   h
0  99  49  23  45
1   9  34  94  83
2  52  71  92  61

In [5]:
pd.concat([df1,df2])

      a     b     c     d     e     f     g     h
0   4.0  19.0  14.0  65.0   NaN   NaN   NaN   NaN
1  70.0  89.0  56.0  49.0   NaN   NaN   NaN   NaN
2  31.0  30.0  18.0   7.0   NaN   NaN   NaN   NaN
0   NaN   NaN   NaN   NaN  99.0  49.0  23.0  45.0
1   NaN   NaN   NaN   NaN   9.0  34.0  94.0  83.0
2   NaN   NaN   NaN   NaN  52.0  71.0  92.0  61.0

In [6]:
pd.concat([df1,df2],axis=1)

    a   b   c   d   e   f   g   h
0   4  19  14  65  99  49  23  45
1  70  89  56  49   9  34  94  83
2  31  30  18   7  52  71  92  61

In [7]:
df1.append(df2)

C:\Users\lokeshranjith\AppData\Local\Temp\ipykernel_9372\3062608662.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2)

      a     b     c     d     e     f     g     h
0   4.0  19.0  14.0  65.0   NaN   NaN   NaN   NaN
1  70.0  89.0  56.0  49.0   NaN   NaN   NaN   NaN
2  31.0  30.0  18.0   7.0   NaN   NaN   NaN   NaN
0   NaN   NaN   NaN   NaN  99.0  49.0  23.0  45.0
1   NaN   NaN   NaN   NaN   9.0  34.0  94.0  83.0
2   NaN   NaN   NaN   NaN  52.0  71.0  92.0  61.0

In [8]:
df1 = pd.DataFrame({'a': ['foo', 'bar'], 'b': [1, 2]})
df2 = pd.DataFrame({'a': ['foo', 'baz'], 'c': [3, 4]})

In [9]:
df1

     a  b
0  foo  1
1  bar  2

In [10]:
df2

     a  c
0  foo  3
1  baz  4

In [11]:
df1.merge(df2)

     a  b  c
0  foo  1  3

In [13]:
arr3=np.random.randint(0,4,5)
df3=pd.DataFrame(arr3,columns=['year of service'])
display(df3)

   year of service
0                3
1                2
2                1
3                2
4                0

In [23]:
pd.concat([df2,df3],axis=1)

     a    c  year of service
0  foo  3.0                3
1  baz  4.0                2
2  NaN  NaN                1
3  NaN  NaN                2
4  NaN  NaN                0

In [25]:
pd.merge(df1,df2)

     a  b  c
0  foo  1  3